# Ex - GroupBy

### Introduction:

GroupBy can be summarized as Split-Apply-Combine.

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

Check out this [Diagram](http://i.imgur.com/yjNkiwL.png)  
### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv).

In [2]:
url = 'https://raw.githubusercontent.com/justmarkham/DAT8/master/data/drinks.csv'
dataframe = pd.read_csv(url)

### Step 3. Assign it to a variable called drinks.

In [4]:
drinks = dataframe
drinks.head()

,country,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol,continent
0,Afghanistan,0,0,0,0.0,AS
1,Albania,89,132,54,4.9,EU
2,Algeria,25,0,14,0.7,AF
3,Andorra,245,138,312,12.4,EU
4,Angola,217,57,45,5.9,AF

### Step 4. Which continent drinks more beer on average?

In [5]:
beer_continent = drinks.groupby(by='continent').sum()
beer_continent.head()

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
AF,3258,866,862,159.4
AS,1630,2677,399,95.5
EU,8720,5965,6400,387.8
OC,1435,935,570,54.1
SA,2101,1377,749,75.7

这个average是求mean

In [27]:
drinks.groupby('continent').beer_servings.mean()

continent
AF     61.471698
AS     37.045455
EU    193.777778
OC     89.687500
SA    175.083333
Name: beer_servings, dtype: float64

In [7]:
beer_continent.sort_values(by='beer_servings', ascending=False)

,beer_servings,spirit_servings,wine_servings,total_litres_of_pure_alcohol
continent,,,,
EU,8720,5965,6400,387.8
AF,3258,866,862,159.4
SA,2101,1377,749,75.7
AS,1630,2677,399,95.5
OC,1435,935,570,54.1

### Step 5. For each continent print the statistics for wine consumption.

In [15]:
for i in beer_continent.index:
  print('Continent:'+i+'\t'+'wine consumption is  '+str(beer_continent.loc[i]['wine_servings']))

Continent:AF	wine consumption is  862.0
Continent:AS	wine consumption is  399.0
Continent:EU	wine consumption is  6400.0
Continent:OC	wine consumption is  570.0
Continent:SA	wine consumption is  749.0

这里的statistics不止是sum,而是每个大陆的wine consumption stats

In [29]:
drinks.groupby(by='continent').wine_servings.describe()

           count        mean        std  min   25%    50%     75%    max
continent
AF          53.0   16.264151  38.846419  0.0   1.0    2.0   13.00  233.0
AS          44.0    9.068182  21.667034  0.0   0.0    1.0    8.00  123.0
EU          45.0  142.222222  97.421738  0.0  59.0  128.0  195.00  370.0
OC          16.0   35.625000  64.555790  0.0   1.0    8.5   23.25  212.0
SA          12.0   62.416667  88.620189  1.0   3.0   12.0   98.50  221.0

### Step 6. Print the mean alcohol consumption per continent for every column

In [22]:
for column in beer_continent.columns:
  print('Continent:  ' + column + '  is  ' + str(beer_continent[column].mean()))

Continent:  beer_servings  is  3428.8
Continent:  spirit_servings  is  2364.0
Continent:  wine_servings  is  1796.0
Continent:  total_litres_of_pure_alcohol  is  154.5

### Step 7. Print the median alcohol consumption per continent for every column

In [20]:
for column in beer_continent.columns:
  print('Continent:  ' + column + '  is  ' + str(beer_continent[column].median()))

Continent:  beer_servings  is  2101.0
Continent:  spirit_servings  is  1377.0
Continent:  wine_servings  is  749.0
Continent:  total_litres_of_pure_alcohol  is  95.5

### Step 8. Print the mean, min and max values for spirit consumption.
#### This time output a DataFrame

In [26]:
drinks_stats = drinks.describe()
drinks_stats.loc[['mean', 'min', 'max'], ['spirit_servings']]

      spirit_servings
mean        80.994819
min          0.000000
max        438.000000

还可以用agg来 subset

In [30]:
drinks.groupby('continent').spirit_servings.agg(['mean', 'min', 'max'])

                 mean  min  max
continent
AF          16.339623    0  152
AS          60.840909    0  326
EU         132.555556    0  373
OC          58.437500    0  254
SA         114.750000   25  302